<?php
/**
 * 商品展示
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2017/1/4 0004
 * Time: 下午 7:52
 */

header('Access-Control-Allow-Origin:*');   //PHP后台设置支持跨域访问


class  goodData{
    public $img;
    public $headline;
    public $nPrice;
    public $oPrice;
    public $goodId;
//    public $link;
}

$goodsNum = $_GET['num'];


$returnData = array();

switch($goodsNum)
{
    //======================================================8=================
    case "1000" :{
        $hArr = array(
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("379","219","298","129","119","69","1280","186");
        $opArr = array("","","","","","99","","399");
//        $linkArr = array("../goodsDetails/goodsDetails.html?goodeId=",);
        for($i=0;$i<8;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "1000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "1001" :{
        $hArr = array(
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("379","219","298","129","119","69","1280","186");
        $opArr = array("","","","","","99","","399");
        for($i=0;$i<8;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "1000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "1002" :{
        $hArr = array(
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("379","219","298","129","119","69","1280","186");
        $opArr = array("","","","","","99","","399");
        for($i=0;$i<8;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "1000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "1003" :{
        $hArr = array(
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("379","219","298","129","119","69","1280","186");
        $opArr = array("","","","","","99","","399");
        for($i=0;$i<8;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "1000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "1004" :{
        $hArr = array(
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("379","219","298","129","119","69","1280","186");
        $opArr = array("","","","","","99","","399");
        for($i=0;$i<8;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "1000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "1005" :{
        $hArr = array(
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("379","219","298","129","119","69","1280","186");
        $opArr = array("","","","","","99","","399");
        for($i=0;$i<8;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "1000" . $i;
            array_push($returnData,$data);
        }
    }break;


    //========================================================10===
    case "2000" :{
        $hArr = array("德芙心印牛奶夹心巧克力 53克/盒",
            "AKG/爱科技 y23U 入耳式HIFI电脑手机线控通话 耳机 蓝色",
            "光明 巧风巧克力味含乳饮料 250ml*24/箱",
            "焙朗 早餐饼牛奶谷物味酥性饼干150g",
            "士力架花生夹心巧克力豪享装70克/条",
            "奥利奥 双心脆威化(香草口味) 232g/盒",
            "益达 至尊草本精华无糖口香糖 56g/瓶",
            "品客加州田园牧场风味薯片110g/罐",
            "满果庄园香蕉干90g/袋",
            "徐福记浓99巧克力鲜奶糖90g/袋"
        );
        $npArr = array("24","258","73","9.5","5.1","13.2","9.9","8.9","6.5","7.8");
        $opArr = array("","","","10.6","","13.8","11.8","","","9");
        for($i=0;$i<10;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-01-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "2000" . $i;
            array_push($returnData,$data);
        }
    }break;

    case "2001" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69");
        $opArr = array("399","599","699","","","","","","","99");
        for($i=0;$i<10;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "2001" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "2002" :{
        $hArr = array("康师傅 3+2酥松夹心饼干(香草奶油味) 354g/包",
            "好时KISSES 扁桃仁牛奶巧克力 82g/袋",
            "德芙心印牛奶夹心巧克力 53克/盒",
            "焙朗 早餐饼牛奶谷物味酥性饼干150g",
            "士力架花生夹心巧克力豪享装70克/条",
            "奥利奥 双心脆威化(香草口味) 232g/盒",
            "益达 至尊草本精华无糖口香糖 56g/瓶",
            "品客加州田园牧场风味薯片110g/罐",
            "满果庄园香蕉干90g/袋",
            "徐福记浓99巧克力鲜奶糖90g/袋"
        );
        $npArr = array("12.7","16.2","24","9.5","5.1","13.2","9.9","8.9","6.5","7.8");
        $opArr = array("13","","","10.6","","13.8","11.8","","","9");
        for($i=0;$i<10;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-01-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "2000" . $i;
            array_push($returnData,$data);
        }
    }break;

    case "2003" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69");
        $opArr = array("399","599","699","","","","","","","99");
        for($i=0;$i<10;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "2001" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "2004" :{
        $hArr = array("德芙心印牛奶夹心巧克力 53克/盒",
            "康师傅 3+2酥松夹心饼干(香草奶油味) 354g/包",
            "好时KISSES 扁桃仁牛奶巧克力 82g/袋",
            "焙朗 早餐饼牛奶谷物味酥性饼干150g",
            "士力架花生夹心巧克力豪享装70克/条",
            "奥利奥 双心脆威化(香草口味) 232g/盒",
            "益达 至尊草本精华无糖口香糖 56g/瓶",
            "品客加州田园牧场风味薯片110g/罐",
            "满果庄园香蕉干90g/袋",
            "徐福记浓99巧克力鲜奶糖90g/袋"
        );
        $npArr = array("24","12.7","16.2","9.5","5.1","13.2","9.9","8.9","6.5","7.8");
        $opArr = array("","13","","10.6","","13.8","11.8","","","9");
        for($i=0;$i<10;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-01-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "2000" . $i;
            array_push($returnData,$data);
        }
    }break;

    case "2005" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69");
        $opArr = array("399","599","699","","","","","","","99");
        for($i=0;$i<10;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "2001" . $i;
            array_push($returnData,$data);
        }
    }break;

    //======================================================12==============================
    case "3000" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69","1280","186");
        $opArr = array("399","599","699","","","","","","","99","","399");
        for($i=0;$i<12;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "3000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "3001" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69","1280","186");
        $opArr = array("399","599","699","","","","","","","99","","399");
        for($i=0;$i<12;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "3000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "3002" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69","1280","186");
        $opArr = array("399","599","699","","","","","","","99","","399");
        for($i=0;$i<12;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "3000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "3003" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69","1280","186");
        $opArr = array("399","599","699","","","","","","","99","","399");
        for($i=0;$i<12;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "3000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "3004" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69","1280","186");
        $opArr = array("399","599","699","","","","","","","99","","399");
        for($i=0;$i<12;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "3000" . $i;
            array_push($returnData,$data);
        }
    }break;
    case "3005" :{
        $hArr = array("猎鹰计划 枫叶户外登山包 徒步野营双肩包 45L ",
            "牧高笛户外装备 登山运动旅行徒步双肩背包28L驴友旅游包JY NMF1324005 ",
            "猎鹰计划 折叠桌椅+烤炉+烧烤配件 玩美假期烧烤组合套装 ZHA19DS",
            "徽羚羊烧烤架套装户外不锈钢折叠式烤炉家庭烧烤炉烧烤架全套便携式烧烤炉",
            "捷昇 不锈钢烧烤架木炭烧烤炉户外便携式碳烤架可自动旋转碳烤架箱 大号 赠送烧烤8件套",
            "wissblue户外全自动帐篷双层速开防暴雨3-4人四季露营野营帐6033",
            "牧高笛户外装备露营防风防雨棚帐篷伴侣门厅帐篷延生普及",
            "创悦 户外帐篷露营三人双层可独立使用野营两用帐篷 CY-",
            "渔之源两用超轻超硬碳素海竿套装组合特价远投竿甩杆钓竿抛竿渔具",
            "渔之源 1.25米硬壳鱼竿包鱼杆包鱼具包硬壳防水钓鱼包渔具包",
            "ifreego品牌 智能扭扭车电动平衡车可带蓝牙遥控",
            "杜戛地DZRZVD 户外冲锋衣 男女秋冬情侣连帽防水三合一两件套抓绒登山服ZT6606"
        );
        $npArr = array("315","578","630","229","379","219","298","129","119","69","1280","186");
        $opArr = array("399","599","699","","","","","","","99","","399");
        for($i=0;$i<12;$i++)
        {
            $data = new goodData();
            $data->img = "images/pd/pd-02-00" .$i . ".jpg";
            $data->headline = $hArr[$i];
            $data->nPrice = $npArr[$i];
            $data->oPrice = $opArr[$i];
            $data->goodId = "3000" . $i;
            array_push($returnData,$data);
        }
    }break;
}



echo json_encode($returnData);


